# Application de seconde main Ã  destination des pays d'Afrique

In [1]:
import sys, os
from pathlib import Path
import pandas as pd 
import numpy as np

In [20]:
from mpl_toolkits.mplot3d import Axes3D
from sklearn.preprocessing import StandardScaler
import matplotlib.pyplot as plt # plotting
import matplotlib.image as mpimg

In [2]:
path=Path.cwd().parent
print(path)

C:\Users\BARRY MOHAMED\Desktop\projet-ia

In [3]:
os.chdir(path)

In [4]:
os.getcwd()

'C:\\Users\\BARRY MOHAMED\\Desktop\\projet-ia'

In [17]:
df_styles=pd.read_csv("./data/styles.csv",sep=';')
df_styles=df_styles.iloc[:,0:-1]
df_styles['filename'] = df_styles.apply(lambda row: str(row['id']) + ".jpg", axis=1)
df_styles.head()

,id,gender,masterCategory,subCategory,articleType,baseColour,season,year,usage,productDisplayName,filename
0,15970,Men,Apparel,Topwear,Shirts,Navy Blue,Fall,2011.0,Casual,Turtle Check Men Navy Blue Shirt,15970.jpg
1,39386,Men,Apparel,Bottomwear,Jeans,Blue,Summer,2012.0,Casual,Peter England Men Party Blue Jeans,39386.jpg
2,59263,Women,Accessories,Watches,Watches,Silver,Winter,2016.0,Casual,Titan Women Silver Watch,59263.jpg
3,21379,Men,Apparel,Bottomwear,Track Pants,Black,Fall,2011.0,Casual,Manchester United Men Solid Black Track Pants,21379.jpg
4,53759,Men,Apparel,Topwear,Tshirts,Grey,Summer,2012.0,Casual,Puma Men Grey T-shirt,53759.jpg

In [18]:
df_images=pd.read_csv("./data/images.csv",sep=';')
df_images.head()

    filename                                               link
0  15970.jpg  http://assets.myntassets.com/v1/images/style/p...
1  39386.jpg  http://assets.myntassets.com/v1/images/style/p...
2  59263.jpg  http://assets.myntassets.com/v1/images/style/p...
3  21379.jpg  http://assets.myntassets.com/v1/images/style/p...
4  53759.jpg  http://assets.myntassets.com/v1/images/style/p...

In [19]:
data=pd.merge(df_styles,df_images, on='filename')
data.head()

,id,gender,masterCategory,subCategory,articleType,baseColour,season,year,usage,productDisplayName,filename,link
0,15970,Men,Apparel,Topwear,Shirts,Navy Blue,Fall,2011.0,Casual,Turtle Check Men Navy Blue Shirt,15970.jpg,http://assets.myntassets.com/v1/images/style/p...
1,39386,Men,Apparel,Bottomwear,Jeans,Blue,Summer,2012.0,Casual,Peter England Men Party Blue Jeans,39386.jpg,http://assets.myntassets.com/v1/images/style/p...
2,59263,Women,Accessories,Watches,Watches,Silver,Winter,2016.0,Casual,Titan Women Silver Watch,59263.jpg,http://assets.myntassets.com/v1/images/style/p...
3,21379,Men,Apparel,Bottomwear,Track Pants,Black,Fall,2011.0,Casual,Manchester United Men Solid Black Track Pants,21379.jpg,http://assets.myntassets.com/v1/images/style/p...
4,53759,Men,Apparel,Topwear,Tshirts,Grey,Summer,2012.0,Casual,Puma Men Grey T-shirt,53759.jpg,http://assets.myntassets.com/v1/images/style/p...

In [34]:
data['baseColour'].value_counts().to_frame().reset_index().head()

   index  baseColour
0  Black        9732
1  White        5540
2   Blue        4922
3  Brown        3494
4   Grey        2741

In [35]:
data['articleType'].value_counts().to_frame().reset_index().head()

          index  articleType
0       Tshirts         7070
1        Shirts         3217
2  Casual Shoes         2846
3       Watches         2542
4  Sports Shoes         2036

In [36]:
data['subCategory'].value_counts().to_frame().reset_index().head()

        index  subCategory
0     Topwear        15405
1       Shoes         7344
2        Bags         3055
3  Bottomwear         2694
4     Watches         2542

In [38]:
data['masterCategory'].value_counts().to_frame().reset_index().head()

           index  masterCategory
0        Apparel           21400
1    Accessories           11289
2       Footwear            9222
3  Personal Care            2404
4     Free Items             105